In [1]:
import numpy as np
import pandas as pd

## Apply

In [4]:
df = pd.DataFrame(
    {'tweet_id':[1, 2],
    'content':['Vote for Biden', 'Let us make America great again!']}
)
df

   tweet_id                           content
0         1                    Vote for Biden
1         2  Let us make America great again!

In [9]:
# Return tweet contents with len greater than 15
df[df['content'].apply(len) > 15]

   tweet_id                           content
1         2  Let us make America great again!

In [10]:
df = pd.DataFrame(
    {
        'id': [2,3,7,8,9],
        'name':['Meir', 'Michael','Addilyn','Juan','Kannon'],
        'salary':[34,38,74,61,77]
    }
)
df

   id     name  salary
0   2     Meir      34
1   3  Michael      38
2   7  Addilyn      74
3   8     Juan      61
4   9   Kannon      77

In [22]:
df['bouns']= df.apply(
    lambda x:x['salary'] if x['id']%2==1 and not x['name'].startswith('M') else 0,
axis =1)
df

   id     name  salary  bouns
0   2     Meir      34      0
1   3  Michael      38      0
2   7  Addilyn      74     74
3   8     Juan      61      0
4   9   Kannon      77     77

## value_counts()

In [4]:
person = pd.DataFrame({
    'id':[1,2,3],
    'email':['a@b.com','c@d.com','a@b.com']
})
person

   id    email
0   1  a@b.com
1   2  c@d.com
2   3  a@b.com

In [10]:
person.value_counts('email')>1

email
a@b.com     True
c@d.com    False
Name: count, dtype: bool